tap 'caskroom/cask'
tap 'git-duet/tap'
tap 'caskroom/fonts'

#For asdf
brew 'autoenv'
brew 'automake'
brew 'autoconf'
brew 'coreutils'
brew 'openssl'
brew 'libyaml'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'readline'

cask 'gpg-suite'

brew 'git'
brew 'hub'
brew 'git-duet'

cask 'font-fira-code'
cask 'font-inconsolata'

brew 'tmux'
brew 'macvim'
brew 'httpie'
#cask 'iterm2'
cask 'atom'

brew 'yarn'

brew 'asdf'

brew 'python3'

brew 'kubernetes-cli'

brew 'the_silver_searcher'
brew 'diff-so-fancy'

mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
mas 'Skitch', id: 425955336
mas '1password', id: 1333542190

cask 'google-chrome'

