
tap 'homebrew/cask'
tap 'git-duet/tap'
tap 'homebrew/cask-fonts'

# For asdf
brew 'autoenv'
brew 'automake'
brew 'autoconf'
brew 'coreutils'
brew 'openssl'
brew 'libyaml'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'readline'

brew 'git'
brew 'hub'
brew 'git-duet'

cask 'font-fira-code'
cask 'font-inconsolata'

cask 'emacs'
brew 'tmux'
brew 'macvim'
brew 'httpie'
cask 'iterm2'
cask 'alacritty'

brew 'bat'

brew 'peco'

brew 'kubernetes-cli'
cask 'google-cloud-sdk'

brew 'the_silver_searcher'
brew 'diff-so-fancy'

brew 'yarn'

cask 'google-chrome'
cask 'brave-browser'

mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
mas '1password', id: 1333542190
