
tap 'homebrew/cask'
tap 'git-duet/tap'
tap 'homebrew/cask-fonts'

# For asdf
brew 'autoenv'
brew 'automake'
brew 'autoconf'
brew 'coreutils'
brew 'openssl'
brew 'libyaml'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'readline'
brew 'httpie'

brew 'git'
brew 'hub'
brew 'git-duet'
brew 'gnupg' 
brew 'pinentry-mac'

cask 'font-fira-code'
cask 'font-inconsolata'

cask 'font-3270-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-monofur-nerd-font'
cask 'font-overpass-nerd-font'
cask 'font-bigblue-terminal-nerd-font'
cask 'font-bigblue-terminal-nerd-font'
cask 'font-bigblue-terminal-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-daddy-time-mono-nerd-font'
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-gohufont-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-shure-tech-mono-nerd-font'
cask 'font-space-mono-nerd-font'
cask 'font-terminess-ttf-nerd-font'
cask 'font-tinos-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'

brew 'starship'

cask 'julia'
cask 'warp'

brew 'httpie'
brew 'bat'
brew 'peco'

brew 'kubernetes-cli'
cask 'google-cloud-sdk'

brew 'the_silver_searcher'
brew 'diff-so-fancy'
brew 'yarn'

cask 'brave-browser'

cask 'vlc'

mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
mas '1password', id: 1333542190
